UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_ДополнительнаяКонтактнаяИнформация/саУНФ_ДополнительнаяКонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>саУНФ_ДополнительнаяКонтактнаяИнформация</name>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>GEOКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_adress</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_ДополнительнаяКонтактнаяИнформация/Forms/ФормаВыбораАдреса/Module.bsl
&НаСервере
Функция ПосчитатьКоличествоВСпискеНаСервере()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = МакетКомпоновки.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
	СтрокаВЫБРАТЬ = Лев(Запрос.Текст, Найти(Запрос.Текст, Символы.ПС));
	
	Запрос.Текст = СтрокаВЫБРАТЬ + "Количество(*) КАК Кол" + Сред(Запрос.Текст, Найти(Запрос.Текст, Символы.ПС + "ИЗ" + Символы.ПС));
	Для Каждого парам из МакетКомпоновки.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(парам.Имя, парам.Значение);
	КонецЦикла;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	         Возврат 0;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат  Выборка.Кол;

КонецФункции



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Контрагент") Тогда
		Закрыть();
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Контрагент);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоСтрок = ПосчитатьКоличествоВСпискеНаСервере();
    Если КоличествоСтрок =0 Тогда
	    СтруктураПараметров = Неопределено;
		Оповестить("Выбран другой адрес",СтруктураПараметров,);
		Закрыть();
	КонецЕсли; 

КонецПроцедуры




&НаСервере
Функция СтруктураПоКлючуРегистра(ВыбраннаяСтрока)
    НаборЗаписей = РегистрыСведений.саУНФ_ДополнительнаяКонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(ВыбраннаяСтрока.Контрагент);
	НаборЗаписей.Отбор.Наименование.Установить(ВыбраннаяСтрока.Наименование); 
	НаборЗаписей.Прочитать();
	
	СтруктураЗаписи = Новый Структура("Наименование,Представление,ЗначенияПолей,Значение",);
	
	Для каждого Запись Из НаборЗаписей Цикл
	       ЗаполнитьЗначенияСвойств(СтруктураЗаписи,Запись);
	КонецЦикла; 
	

	 Возврат  СтруктураЗаписи;

КонецФункции // ()


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = СтруктураПоКлючуРегистра(ВыбраннаяСтрока);
	Оповестить("Выбран другой адрес",СтруктураПараметров,);
	Закрыть();
КонецПроцедуры
